---
kind: method
id: M:Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry.GetServices
source: html/1c4ae954-af57-329b-f18d-f4f670b79eec.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry.GetServices Method

Returns a collection of all external services currently registered in Revit.

## Syntax (C#)
```csharp
public static IList<ExternalService> GetServices()
```

## Returns
Array of ExternalService instances.